DataProcessors/ВРаботеДолжникиПоБанку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ВРаботеДолжникиПоБанку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЗадолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежей</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментарии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VINНОМЕР</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Залог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПривязкаОтдел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаОтдел</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПул</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПулПовторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НачальныеДанныеДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НачальныеДанныеДоговора</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыДолжников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДолжников</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ДанныеДоговоров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоЗадолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныйОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неустойка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчетаЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Платежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>Платежи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вознаграждение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтметкаФССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/РольОтдела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РольОтдела</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обзвон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выездной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информационный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрекращениеРаботы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Отделы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Отделы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РольОтдела</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольОтдела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВознаграждениеЗаСотрудников</Name>
					<Comment>Вознаграждение за сотрудников %</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВозможныеТипыКонтактов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Регионы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ВРаботеДолжникиПоБанку/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	// Вставить содержимое обработчика.
	
	
	   
	  //НайтиВсехДолжниковНаДату();
	
		НайтиВсехДолжниковНаДату2();

	
КонецПроцедуры



&НаСервере
Процедура НайтиВсехДолжниковНаДату2()
	
    Объект.ТЧ.Очистить();
	
	ОтделАрхив=Справочники.Отделы.НайтиПоРеквизиту("РольОтдела",Перечисления.РольОтдела.Архив);
	
	БанкЭкс=Новый Массив(3);
	
	БанкЭкс[0]= Справочники.Банки.НайтиПоНаименованию("ЭКСПО");
	БанкЭкс[1]=Справочники.Банки.НайтиПоНаименованию("ЭКСПО АМБ");
	
	БанкЭкс[2]=Справочники.Банки.НайтиПоНаименованию("ЭКСПОББ");
	
	//  ЭКСПО АМБ,  ЭКСПОББ   

	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаОтделСрезПоследних.Должник КАК Должник,
		|	ПривязкаОтделСрезПоследних.Отдел КАК Отдел
		|ПОМЕСТИТЬ НеАрхивОтдел
		|ИЗ
		|	РегистрСведений.ПривязкаОтдел.СрезПоследних(&МоментВремени, ) КАК ПривязкаОтделСрезПоследних
		|ГДЕ
		|	ПривязкаОтделСрезПоследних.Отдел.РольОтдела <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеАрхивОтдел.Должник КАК Должник,
		|	НеАрхивОтдел.Отдел КАК Отдел,
		|	Банки.Ссылка КАК БанкиСсылка
		|ИЗ
		|	НеАрхивОтдел КАК НеАрхивОтдел
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ПО Договоры.Банк = Банки.Ссылка
		|		ПО НеАрхивОтдел.Должник = Договоры.Владелец
		|ГДЕ
		|	Банки.Ссылка В(&БанкСсылка)";
	
	Запрос.УстановитьПараметр("БанкСсылка", БанкЭкс);
	
	Запрос.УстановитьПараметр("МоментВремени", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("Ссылка", Перечисления.РольОтдела.Архив);

	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Кол=ВыборкаДетальныеЗаписи.Количество();
	 
	КолДолжниковНаНаяало=Кол;
	
	
	
	
			
			
	  //.Кол-во должников в архиве на начало
	  
	   Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаОтделСрезПоследних.Должник КАК Должник,
		|	ПривязкаОтделСрезПоследних.Отдел КАК Отдел
		|ПОМЕСТИТЬ НеАрхивОтдел
		|ИЗ
		|	РегистрСведений.ПривязкаОтдел.СрезПоследних(&МоментВремени, ) КАК ПривязкаОтделСрезПоследних
		|ГДЕ
		|	ПривязкаОтделСрезПоследних.Отдел.РольОтдела = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеАрхивОтдел.Должник КАК Должник,
		|	НеАрхивОтдел.Отдел КАК Отдел,
		|	Банки.Ссылка КАК БанкиСсылка
		|ИЗ
		|	НеАрхивОтдел КАК НеАрхивОтдел
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ПО Договоры.Банк = Банки.Ссылка
		|		ПО НеАрхивОтдел.Должник = Договоры.Владелец
		|ГДЕ
		|	Банки.Ссылка В(&БанкСсылка)";
	
	Запрос.УстановитьПараметр("БанкСсылка", БанкЭкс);
	
	Запрос.УстановитьПараметр("МоментВремени", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("Ссылка", Перечисления.РольОтдела.Архив);

	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КолВАрхивеНаНачало=ВыборкаДетальныеЗаписи.Количество();
	
	//Сообщить(КолВАрхивеНаНачало);
	
	
	     //.Кол-во должников в архиве на Конец
	  
	   Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаОтделСрезПоследних.Должник КАК Должник,
		|	ПривязкаОтделСрезПоследних.Отдел КАК Отдел
		|ПОМЕСТИТЬ НеАрхивОтдел
		|ИЗ
		|	РегистрСведений.ПривязкаОтдел.СрезПоследних(&МоментВремени, ) КАК ПривязкаОтделСрезПоследних
		|ГДЕ
		|	ПривязкаОтделСрезПоследних.Отдел.РольОтдела = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеАрхивОтдел.Должник КАК Должник,
		|	НеАрхивОтдел.Отдел КАК Отдел,
		|	Банки.Ссылка КАК БанкиСсылка
		|ИЗ
		|	НеАрхивОтдел КАК НеАрхивОтдел
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ПО Договоры.Банк = Банки.Ссылка
		|		ПО НеАрхивОтдел.Должник = Договоры.Владелец
		|ГДЕ
		|	Банки.Ссылка В(&БанкСсылка)";
	
	Запрос.УстановитьПараметр("БанкСсылка", БанкЭкс);
	
	Запрос.УстановитьПараметр("МоментВремени", Объект.ДатаКонец);
	Запрос.УстановитьПараметр("Ссылка", Перечисления.РольОтдела.Архив);

	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КолВАрхивеНаКонец=ВыборкаДетальныеЗаписи.Количество();
	
	//Сообщить(КолВАрхивеНаКонец);
	
	 ПогасилосьВОтчетномПериоде=КолВАрхивеНаКонец-КолВАрхивеНаНачало;
	 
	 
	 
	 
	 //  А попробую по рееестрам пройду
	 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачальныеДанныеДоговора.Договор КАК Договор,
		|	НачальныеДанныеДоговора.Договор.Владелец КАК ДоговорВладелец
		|ИЗ
		|	РегистрСведений.НачальныеДанныеДоговора КАК НачальныеДанныеДоговора
		|ГДЕ
		|	НачальныеДанныеДоговора.Период МЕЖДУ &ДатаНачала И &ДатаКонец
		|	И НачальныеДанныеДоговора.Договор.Банк В (&Банк)";
	
	Запрос.УстановитьПараметр("Банк", БанкЭкс);
	Запрос.УстановитьПараметр("ДатаКонец", Объект.ДатаКонец);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		
	КолДолжПолученоЗаПериод= ВыборкаДетальныеЗаписи.Количество();

	 
	 
	 
	 
	
	
//Кол-во должников в работе на Конец периода
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаОтделСрезПоследних.Должник КАК Должник,
		|	ПривязкаОтделСрезПоследних.Отдел КАК Отдел
		|ПОМЕСТИТЬ НеАрхивОтдел
		|ИЗ
		|	РегистрСведений.ПривязкаОтдел.СрезПоследних(&МоментВремени, ) КАК ПривязкаОтделСрезПоследних
		|ГДЕ
		|	ПривязкаОтделСрезПоследних.Отдел.РольОтдела <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеАрхивОтдел.Должник КАК Должник,
		|	НеАрхивОтдел.Отдел КАК Отдел,
		|	Банки.Ссылка КАК БанкиСсылка
		|ИЗ
		|	НеАрхивОтдел КАК НеАрхивОтдел
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ПО Договоры.Банк = Банки.Ссылка
		|		ПО НеАрхивОтдел.Должник = Договоры.Владелец
		|ГДЕ
		|	Банки.Ссылка В(&БанкСсылка)";
	
	Запрос.УстановитьПараметр("БанкСсылка", БанкЭкс);
	
	Запрос.УстановитьПараметр("МоментВремени", Объект.ДатаКонец);
	Запрос.УстановитьПараметр("Ссылка", Перечисления.РольОтдела.Архив);

	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Кол=ВыборкаДетальныеЗаписи.Количество();
	 
	КолДолжниковНаКонецПер=Кол;

	КолДолжниковНаКонец=КолДолжниковНаКонецПер;
	
	//КолДолжПолученоЗаПериод=КолДолжниковНаКонецПер-КолДолжниковНаНаяало- ПогасилосьВОтчетномПериоде;
	
	Сообщить(КолДолжниковНаКонецПер-КолДолжниковНаНаяало- ПогасилосьВОтчетномПериоде);
	
	//Сообщить(КолДолжниковНаКонецПер- КолВАрхивеНаНачало);
	 
	
  
	  
	  
	  
	  
	  
	  
      
	 // Совершено платежей в отчетном периоде[Степанов И.А.]  Кол-во платежей за период с ХХХ по ХХХ 
	 
	 
	 
	 СуммаИтог=0;
	 
	 
    	//СУММА(ПлатежиДолжники.Сумма) КАК Сумма

    	
    	  Запрос = Новый Запрос;
         Запрос.Текст = 
    	"ВЫБРАТЬ
    	|	СУММА(ПлатежиДолжники.Сумма) КАК Сумма
    	|ИЗ
    	|	Документ.Платежи.Должники КАК ПлатежиДолжники
    	|ГДЕ
    	|	ПлатежиДолжники.Ссылка.Банк В(&Банк) И ПлатежиДолжники.Ссылка.Проведен = Истина 
    	|	И ПлатежиДолжники.ДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаКонец";
    
    
    
    // 
    //  КоличествоПлатежейЗаПериод=ВыборкаДетальныеЗаписи.Количество();

      Запрос.УстановитьПараметр("Банк", БанкЭкс);
    Запрос.УстановитьПараметр("ДатаКонец", Объект.ДатаКонец);
    Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);

    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
   КоличествоПлатежейЗаПериод=ВыборкаДетальныеЗаписи.Количество();

    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    	// Вставить обработку выборки ВыборкаДетальныеЗаписи
    	
    	  СуммаИтог=ВыборкаДетальныеЗаписи.Сумма;
    	
    	
    КонецЦикла;
    

	
	
	
	СуммаПлатежейЗаПериод=СуммаИтог;
		

	
	
	




  	ТабВрем=Новый ТаблицаЗначений;
				ТабВрем.Колонки.Добавить("Должник",Новый ОписаниеТипов("СправочникСсылка.Должники"));
				ТабВрем.Колонки.Добавить("Договор",Новый ОписаниеТипов("СправочникСсылка.Договоры"));
				ТабВрем.Колонки.Добавить("Банк",Новый ОписаниеТипов("СправочникСсылка.Банки"));
				
				ТабВрем.Колонки.Добавить("ВсегоЗадолженность");
				ТабВрем.Колонки.Добавить("Регион");
				ТабВрем.Колонки.Добавить("Статус");
				ТабВрем.Колонки.Добавить("СуммаПлатежей");
				ТабВрем.Колонки.Добавить("Коментарии");
				ТабВрем.Колонки.Добавить("VINНОМЕР");
				ТабВрем.Колонки.Добавить("Залог");
				
				ТабВрем.Колонки.Добавить("Отдел",Новый ОписаниеТипов("СправочникСсылка.Отделы"));
				
				
				




	
	МенВрТаб = Новый МенеджерВременныхТаблиц;
	
	
 // ПривязкаОтделСрезПоследних и Статус 
	ЗапросПривязкаОтделДолжники = Новый Запрос;
	ЗапросПривязкаОтделДолжники.МенеджерВременныхТаблиц = МенВрТаб;
	ЗапросПривязкаОтделДолжники.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаОтделСрезПоследних.Должник КАК Должник,
		|	ПривязкаОтделСрезПоследних.Отдел КАК Отдел,
		|   ПривязкаОтделСрезПоследних.Отдел.РольОтдела КАК РольОтдела
		|ПОМЕСТИТЬ ПривязкаОтделДолжники
		|ИЗ
		|	РегистрСведений.ПривязкаОтдел.СрезПоследних(&МоментВремени, ) КАК ПривязкаОтделСрезПоследних
		|ГДЕ
		|	ПривязкаОтделСрезПоследних.Отдел.РольОтдела <> &РольОтдела
		|ИНДЕКСИРОВАТЬ ПО
        | Должник,РольОтдела";
	
	ЗапросПривязкаОтделДолжники.УстановитьПараметр("МоментВремени", Объект.ДатаКонец);
	ЗапросПривязкаОтделДолжники.УстановитьПараметр("РольОтдела", Перечисления.РольОтдела.Архив);
	
	ЗапросПривязкаОтделДолжники.Выполнить();
		
	ЗапросСтатусыДолжников = Новый Запрос;
	ЗапросСтатусыДолжников.МенеджерВременныхТаблиц = МенВрТаб;
	ЗапросСтатусыДолжников.Текст = 
		"ВЫБРАТЬ
		|	СтатусыДолжниковСрезПоследних.Статус КАК Статус,
		|   СтатусыДолжниковСрезПоследних.Должник КАК Должник
		|ПОМЕСТИТЬ СтатусыДолжников
		|ИЗ
		|	РегистрСведений.СтатусыДолжников.СрезПоследних(&МоментВремени, ) КАК СтатусыДолжниковСрезПоследних
		|ИНДЕКСИРОВАТЬ ПО
        | Должник";
		
	ЗапросСтатусыДолжников.УстановитьПараметр("МоментВремени", Объект.ДатаКонец);

	ЗапросСтатусыДолжников.Выполнить();
	
	
	ЗапросДолжники = Новый Запрос;
	ЗапросДолжники.МенеджерВременныхТаблиц = МенВрТаб;
	
	ЗапросДолжники.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаОтделДолжники.Должник КАК Должник,
		|	ПривязкаОтделДолжники.Отдел КАК Отдел,
		|	СтатусыДолжников.Статус КАК Статус
		|ПОМЕСТИТЬ Должники
		|ИЗ
		|	    ПривязкаОтделДолжники КАК ПривязкаОтделДолжники
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыДолжников КАК СтатусыДолжников
		|		ПО ПривязкаОтделДолжники.Должник = СтатусыДолжников.Должник";
			
    ЗапросДолжники.Выполнить();
	
	
	 // СуммаКредитаД

	 
	ЗапросДоговорыД = Новый Запрос;
    ЗапросДоговорыД.МенеджерВременныхТаблиц = МенВрТаб;
    ЗапросДоговорыД.Текст = 
		"ВЫБРАТЬ Договоры.СуммаКредита КАК СуммаКредита,
		|	Договоры.Владелец.Ссылка КАК ВладелецСсылка,
		|	Договоры.Банк КАК БанкД,
		|	Договоры.Ссылка КАК СсылкаДоговор
		|ПОМЕСТИТЬ ДоговорыД
		|ИЗ
		|Справочник.Договоры КАК Договоры
		|		
		|ГДЕ
		|	Договоры.Банк В(&Банк)
	    |ИНДЕКСИРОВАТЬ ПО
        | СсылкаДоговор";
 

	  ЗапросДоговорыД.УстановитьПараметр("Банк", БанкЭкс);
	  рез1= ЗапросДоговорыД.Выполнить();

	  
		
	   
	ЗапросДанныеДоговоров = Новый Запрос;
    ЗапросДанныеДоговоров.МенеджерВременныхТаблиц = МенВрТаб;
	ЗапросДанныеДоговоров.Текст = 
	     "ВЫБРАТЬ
		|	ДанныеДоговоровСрезПоследних.ВсегоЗадолженность КАК ВсегоЗадолженность,
		|   ДанныеДоговоровСрезПоследних.Договор   КАК Договор 
		|ПОМЕСТИТЬ ДанныеДоговоров
		|ИЗ
		|	РегистрСведений.ДанныеДоговоров.СрезПоследних(&МоментВремени, ) КАК ДанныеДоговоровСрезПоследних
	    |ИНДЕКСИРОВАТЬ ПО
        |  Договор";
 

			
	 ЗапросДанныеДоговоров.УстановитьПараметр("МоментВремени", Объект.ДатаКонец);
     рез= ЗапросДанныеДоговоров.Выполнить();    
	  
	 
	 ЗапросСуммаКредитаД = Новый Запрос;
	 ЗапросСуммаКредитаД.МенеджерВременныхТаблиц = МенВрТаб;
	 
	ЗапросСуммаКредитаД.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыД.СуммаКредита КАК СуммаКредита,
		|	ДоговорыД.ВладелецСсылка КАК ВладелецСсылка,
		|	ДоговорыД.СсылкаДоговор КАК СсылкаДоговор,
		|	ДоговорыД.БанкД КАК БанкД,
		|	ДанныеДоговоров.ВсегоЗадолженность КАК ВсегоЗадолженность
		|ПОМЕСТИТЬ СуммаКредитаД
		|ИЗ
		|	ДанныеДоговоров   КАК ДанныеДоговоров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыД КАК ДоговорыД
		|		ПО ДоговорыД.СсылкаДоговор=ДанныеДоговоров.Договор";
	  ЗапросСуммаКредитаД.Выполнить();

	  
	  
	  
	  
	     ЗапросДолжникиВсе = Новый Запрос;
	   ЗапросДолжникиВсе.МенеджерВременныхТаблиц = МенВрТаб;
	   ЗапросДолжникиВсе.Текст = 
	    "ВЫБРАТЬ
		|	СуммаКредитаД.СуммаКредита КАК СуммаКредита,
		|	Должники.Статус КАК Статус,
		|	Должники.Отдел КАК Отдел,
		|	Должники.Должник.Регион.СинонимФСПП КАК ДолжникРегионСинонимФСПП,
		|	СуммаКредитаД.СсылкаДоговор КАК СсылкаДоговор,
		|	СуммаКредитаД.БанкД КАК БанкД,
		|	Должники.Должник КАК Должник,
		|	СуммаКредитаД.ВсегоЗадолженность КАК ВсегоЗадолженность
		|ИЗ
		|	Должники КАК Должники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммаКредитаД КАК СуммаКредитаД
		|		ПО Должники.Должник = СуммаКредитаД.ВладелецСсылка";

	  РезультатЗапроса= ЗапросДолжникиВсе.Выполнить();  
	 
	  Выборка = РезультатЗапроса.Выбрать();
	  Пока Выборка.Следующий() Цикл
	    
			
				
				
				
				
			  Запись=ТабВрем.Добавить();
			  Запись.Должник=Выборка.Должник;
			  Запись.Договор=Выборка.СсылкаДоговор;
			  Запись.ВсегоЗадолженность=Выборка.ВсегоЗадолженность;
			  Запись.Регион=Выборка.ДолжникРегионСинонимФСПП;
			  Запись.Статус=Выборка.Статус;
			  Запись.Банк=Выборка.БанкД;
			  Запись.Отдел=Выборка.Отдел;
			  
			  
			  
			  

			  
			  
			  
			  // Найду все платежи этого должника
			  
												
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ПлатежиОбороты.СуммаОборот КАК СуммаОборот
							|ИЗ
							|	РегистрНакопления.Платежи.Обороты(
							|			,
							|			,
							|			,
							|			Должник = &Должник
							|				И Договор = &Договор) КАК ПлатежиОбороты";
						
						Запрос.УстановитьПараметр("Договор", Выборка.СсылкаДоговор);
						Запрос.УстановитьПараметр("Должник", Выборка.Должник);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
						 Запись.СуммаПлатежей=ВыборкаДетальныеЗаписи.СуммаОборот;	
						КонецЦикла;
						
					
		// найду коментарии за период  Документ Контакт
		
		                        КоментарийСтрока="";
		
		                             	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
										// Данный фрагмент построен конструктором.
										// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
										
										Запрос = Новый Запрос;
										Запрос.Текст = 
											"ВЫБРАТЬ
											|	Контакт.Комментарий КАК Комментарий
											|ИЗ
											|	Документ.Контакт КАК Контакт
											|ГДЕ
											|	Контакт.Дата МЕЖДУ &ДатаНачала И &ДатаКонец
											|	И Контакт.Должник = &Должник";
										
										Запрос.УстановитьПараметр("ДатаКонец", Объект.ДатаКонец);
										Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
										Запрос.УстановитьПараметр("Должник", Выборка.Должник);
										
										РезультатЗапроса = Запрос.Выполнить();
										
										ВыборкаКоментарий = РезультатЗапроса.Выбрать();
										
										Пока ВыборкаКоментарий.Следующий() Цикл
											// Вставить обработку выборки ВыборкаДетальныеЗаписи
											
											 КоментарийСтрока=КоментарийСтрока+ ВыборкаКоментарий.Комментарий+Символы.ВК;
											
										КонецЦикла;
										
										//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
										
										
	                       Запись.Коментарии=КоментарийСтрока; 
										 
						   
						   //Найду VIN
						   
						  СсылкаДопРекв=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("VIN");
						  
						  СсылкаДопРеквЗалог=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("ЗАЛОГ");
						  
						   
						   допреквин="";
						   допрекзалог="";
						   
						//   
						//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						// Данный фрагмент построен конструктором.
						// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
						//
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ДополнительныеДанные.Наименование КАК Наименование,
							|	ДополнительныеДанные.Реквизит КАК Реквизит
							|ИЗ
							|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
							|ГДЕ
							|	ДополнительныеДанные.Владелец = &Владелец
							|	И ДополнительныеДанные.Реквизит = &Реквизит";
						
						Запрос.УстановитьПараметр("Владелец", Выборка.Должник);
						Запрос.УстановитьПараметр("Реквизит", СсылкаДопРекв);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДопРек = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДопРек.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
							  допреквин=допреквин+" "+ВыборкаДопРек.Наименование;
							
						КонецЦикла;
						
						//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ДополнительныеДанные.Наименование КАК Наименование,
							|	ДополнительныеДанные.Реквизит КАК Реквизит
							|ИЗ
							|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
							|ГДЕ
							|	ДополнительныеДанные.Владелец = &Владелец
							|	И ДополнительныеДанные.Реквизит = &Реквизит";
						
						Запрос.УстановитьПараметр("Владелец", Выборка.Должник);
						Запрос.УстановитьПараметр("Реквизит", СсылкаДопРеквЗалог);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДопРек = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДопРек.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
							  допрекзалог=допрекзалог+" "+ВыборкаДопРек.Наименование;
							
						КонецЦикла;

						
						
						

						


					Запись.VINНОМЕР=допреквин;
					
					Запись.Залог=допрекзалог;
			  
			  

				

		  
		  
		  
	  КонецЦикла;
 
	  
	  
	            
	               Объект.ТЧ.Загрузить(ТабВрем);
	
				   Объект.ТЧ.Сортировать("Должник");

	  
	  
	  //
	  // ЗапросДолжникиВсе = Новый Запрос;
	  // ЗапросДолжникиВсе.МенеджерВременныхТаблиц = МенВрТаб;
	  // ЗапросДолжникиВсе.Текст = 
	  //  "ВЫБРАТЬ
	  //  |	СуммаКредитаД.СуммаКредита КАК СуммаКредита,
	  //  |	Должники.Должник.Регион.СинонимФСПП КАК ДолжникРегионСинонимФСПП,
	  //  |	СуммаКредитаД.Ссылка КАК Ссылка,
	  //  |	Должники.Статус КАК Статус,
	  //  |	СуммаКредитаД.Ссылка КАК СсылкаДоговор,
	  //  |	СуммаКредитаД.Ссылка.НомерДоговора КАК СсылкаНомерДоговора,
	  //  |	Должники.Должник КАК Должник,
	  //  |	СуммаКредитаД.ВсегоЗадолженность КАК ВсегоЗадолженность
	  //  |ИЗ
	  //  |	Должники КАК Должники
	  //  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммаКредитаД КАК СуммаКредитаД
	  //  |		ПО Должники.Должник = СуммаКредитаД.ВладелецСсылка";

	  //ЗапросДолжникиВсе.Выполнить();  
	  //
	  
	  
	  
	  
		
		
		
	
	//
	//ТабВрем=Новый ТаблицаЗначений;
	//ТабВрем.Колонки.Добавить("Должник",Новый ОписаниеТипов("СправочникСсылка.Должники"));
	//ТабВрем.Колонки.Добавить("Договор",Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	//ТабВрем.Колонки.Добавить("ВсегоЗадолженность");
	//ТабВрем.Колонки.Добавить("Регион");
	//ТабВрем.Колонки.Добавить("Статус");
	//ТабВрем.Колонки.Добавить("СуммаПлатежей");
	//ТабВрем.Колонки.Добавить("Коментарии");
	//ТабВрем.Колонки.Добавить("VINНОМЕР");
	//ТабВрем.Колонки.Добавить("Залог");
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПривязкаОтделСрезПоследних.Должник КАК Должник,
	//	|	СтатусыДолжниковСрезПоследних.Статус КАК Статус
	//	|ПОМЕСТИТЬ Должники
	//	|ИЗ
	//	|	РегистрСведений.ПривязкаОтдел.СрезПоследних(&МоментВремени, ) КАК ПривязкаОтделСрезПоследних
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДолжников.СрезПоследних(&МоментВремени, ) КАК СтатусыДолжниковСрезПоследних
	//	|		ПО ПривязкаОтделСрезПоследних.Должник = СтатусыДолжниковСрезПоследних.Должник
	//	|ГДЕ
	//	|	ПривязкаОтделСрезПоследних.Отдел.РольОтдела <> &РольОтдела
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	Договоры.СуммаКредита КАК СуммаКредита,
	//	|	Договоры.Владелец.Ссылка КАК ВладелецСсылка,
	//	|	Договоры.Ссылка КАК Ссылка,
	//	|	ДанныеДоговоровСрезПоследних.ВсегоЗадолженность КАК ВсегоЗадолженность
	//	|ПОМЕСТИТЬ СуммаКредитаД
	//	|ИЗ
	//	|	РегистрСведений.ДанныеДоговоров.СрезПоследних(&МоментВремени, ) КАК ДанныеДоговоровСрезПоследних
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	//	|		ПО ДанныеДоговоровСрезПоследних.Договор = Договоры.Ссылка
	//	|ГДЕ
	//	|	Договоры.Банк В(&Банк)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СуммаКредитаД.СуммаКредита КАК СуммаКредита,
	//	|	Должники.Должник.Регион.СинонимФСПП КАК ДолжникРегионСинонимФСПП,
	//	|	СуммаКредитаД.Ссылка КАК Ссылка,
	//	|	Должники.Статус КАК Статус,
	//	|	СуммаКредитаД.Ссылка КАК СсылкаДоговор,
	//	|	СуммаКредитаД.Ссылка.НомерДоговора КАК СсылкаНомерДоговора,
	//	|	Должники.Должник КАК Должник,
	//	|	СуммаКредитаД.ВсегоЗадолженность КАК ВсегоЗадолженность
	//	|ИЗ
	//	|	Должники КАК Должники
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммаКредитаД КАК СуммаКредитаД
	//	|		ПО Должники.Должник = СуммаКредитаД.ВладелецСсылка";

	//
	//	
	//Запрос.УстановитьПараметр("Банк", БанкЭкс);
	//Запрос.УстановитьПараметр("МоментВремени", Объект.ДатаКонец);
	//Запрос.УстановитьПараметр("РольОтдела", Перечисления.РольОтдела.Архив);



	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//	
	//		 
	//		  
	//		  Запись=ТабВрем.Добавить();
	//		  Запись.Должник=Выборка.Должник;
	//		  Запись.Договор=Выборка.СсылкаДоговор;
	//		  Запись.ВсегоЗадолженность=Выборка.ВсегоЗадолженность;
	//		  Запись.Регион=Выборка.ДолжникРегионСинонимФСПП;
	//		  Запись.Статус=Выборка.Статус;
	//		  
	//		  

	//		  
	//		  
	//		  
	//		  // Найду все платежи этого должника
	//		  
	//											
	//					Запрос = Новый Запрос;
	//					Запрос.Текст = 
	//						"ВЫБРАТЬ
	//						|	ПлатежиОбороты.СуммаОборот КАК СуммаОборот
	//						|ИЗ
	//						|	РегистрНакопления.Платежи.Обороты(
	//						|			,
	//						|			,
	//						|			,
	//						|			Должник = &Должник
	//						|				И Договор = &Договор) КАК ПлатежиОбороты";
	//					
	//					Запрос.УстановитьПараметр("Договор", Выборка.СсылкаДоговор);
	//					Запрос.УстановитьПараметр("Должник", Выборка.Должник);
	//					
	//					РезультатЗапроса = Запрос.Выполнить();
	//					
	//					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//					
	//					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//						// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//						
	//					 Запись.СуммаПлатежей=ВыборкаДетальныеЗаписи.СуммаОборот;	
	//					КонецЦикла;
	//					
	//				
	//	// найду коментарии за период  Документ Контакт
	//	
	//	                        КоментарийСтрока="";
	//	
	//	                             	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//									// Данный фрагмент построен конструктором.
	//									// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//									
	//									Запрос = Новый Запрос;
	//									Запрос.Текст = 
	//										"ВЫБРАТЬ
	//										|	Контакт.Комментарий КАК Комментарий
	//										|ИЗ
	//										|	Документ.Контакт КАК Контакт
	//										|ГДЕ
	//										|	Контакт.Дата МЕЖДУ &ДатаНачала И &ДатаКонец
	//										|	И Контакт.Должник = &Должник";
	//									
	//									Запрос.УстановитьПараметр("ДатаКонец", Объект.ДатаКонец);
	//									Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	//									Запрос.УстановитьПараметр("Должник", Выборка.Должник);
	//									
	//									РезультатЗапроса = Запрос.Выполнить();
	//									
	//									ВыборкаКоментарий = РезультатЗапроса.Выбрать();
	//									
	//									Пока ВыборкаКоментарий.Следующий() Цикл
	//										// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//										
	//										 КоментарийСтрока=КоментарийСтрока+ ВыборкаКоментарий.Комментарий+Символы.ВК;
	//										
	//									КонецЦикла;
	//									
	//									//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//									
	//									
	//                       Запись.Коментарии=КоментарийСтрока; 
	//									 
	//					   
	//					   //Найду VIN
	//					   
	//					  СсылкаДопРекв=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("VIN");
	//					  
	//					  СсылкаДопРеквЗалог=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("ЗАЛОГ");
	//					  
	//					   
	//					   допреквин="";
	//					   допрекзалог="";
	//					   
	//					//   
	//					//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//					// Данный фрагмент построен конструктором.
	//					// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//					//
	//					Запрос = Новый Запрос;
	//					Запрос.Текст = 
	//						"ВЫБРАТЬ
	//						|	ДополнительныеДанные.Наименование КАК Наименование,
	//						|	ДополнительныеДанные.Реквизит КАК Реквизит
	//						|ИЗ
	//						|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
	//						|ГДЕ
	//						|	ДополнительныеДанные.Владелец = &Владелец
	//						|	И ДополнительныеДанные.Реквизит = &Реквизит";
	//					
	//					Запрос.УстановитьПараметр("Владелец", Выборка.Должник);
	//					Запрос.УстановитьПараметр("Реквизит", СсылкаДопРекв);
	//					
	//					РезультатЗапроса = Запрос.Выполнить();
	//					
	//					ВыборкаДопРек = РезультатЗапроса.Выбрать();
	//					
	//					Пока ВыборкаДопРек.Следующий() Цикл
	//						// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//						
	//						  допреквин=допреквин+" "+ВыборкаДопРек.Наименование;
	//						
	//					КонецЦикла;
	//					
	//					//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//					
	//					
	//					Запрос = Новый Запрос;
	//					Запрос.Текст = 
	//						"ВЫБРАТЬ
	//						|	ДополнительныеДанные.Наименование КАК Наименование,
	//						|	ДополнительныеДанные.Реквизит КАК Реквизит
	//						|ИЗ
	//						|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
	//						|ГДЕ
	//						|	ДополнительныеДанные.Владелец = &Владелец
	//						|	И ДополнительныеДанные.Реквизит = &Реквизит";
	//					
	//					Запрос.УстановитьПараметр("Владелец", Выборка.Должник);
	//					Запрос.УстановитьПараметр("Реквизит", СсылкаДопРеквЗалог);
	//					
	//					РезультатЗапроса = Запрос.Выполнить();
	//					
	//					ВыборкаДопРек = РезультатЗапроса.Выбрать();
	//					
	//					Пока ВыборкаДопРек.Следующий() Цикл
	//						// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//						
	//						  допрекзалог=допрекзалог+" "+ВыборкаДопРек.Наименование;
	//						
	//					КонецЦикла;

	//					
	//					
	//					

	//					


	//				Запись.VINНОМЕР=допреквин;
	//				
	//				Запись.Залог=допрекзалог;
	//		  
	//		  
	//		  
	//		  
	//		  
	//	
	//КонецЦикла;
	//




	//


	//               Объект.ТЧ.Загрузить(ТабВрем);
	//
	//			   Объект.ТЧ.Сортировать("Должник");

	//
	//
	//
	
	
	
	
КонецПроцедуры




&НаСервере
Процедура НайтиВсехДолжниковНаДату()

	
	 Объект.ТЧ.Очистить();

	
	ОтделАрхив=Справочники.Отделы.НайтиПоРеквизиту("РольОтдела",Перечисления.РольОтдела.Архив);
	
	БанкЭкс=Новый Массив(3);
	
	БанкЭкс[0]= Справочники.Банки.НайтиПоНаименованию("ЭКСПО");
	БанкЭкс[1]=Справочники.Банки.НайтиПоНаименованию("ЭКСПО АМБ");
	
	БанкЭкс[2]=Справочники.Банки.НайтиПоНаименованию("ЭКСПОББ");
	
	//  ЭКСПО АМБ,  ЭКСПОББ   
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаОтделСрезПоследних.Должник КАК Должник,
		|	ПривязкаОтделСрезПоследних.Отдел КАК Отдел
		|ПОМЕСТИТЬ НеАрхивОтдел
		|ИЗ
		|	РегистрСведений.ПривязкаОтдел.СрезПоследних(&МоментВремени, ) КАК ПривязкаОтделСрезПоследних
		|ГДЕ
		|	ПривязкаОтделСрезПоследних.Отдел.РольОтдела <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеАрхивОтдел.Должник КАК Должник,
		|	НеАрхивОтдел.Отдел КАК Отдел,
		|	Банки.Ссылка КАК БанкиСсылка
		|ИЗ
		|	НеАрхивОтдел КАК НеАрхивОтдел
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ПО Договоры.Банк = Банки.Ссылка
		|		ПО НеАрхивОтдел.Должник = Договоры.Владелец
		|ГДЕ
		|	Банки.Ссылка В(&БанкСсылка)";
	
	Запрос.УстановитьПараметр("БанкСсылка", БанкЭкс);
	
	Запрос.УстановитьПараметр("МоментВремени", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("Ссылка", Перечисления.РольОтдела.Архив);

	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Кол=ВыборкаДетальныеЗаписи.Количество();
	 
	КолДолжниковНаНаяало=Кол;
	
	
	
	
			//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
			//	       Сообщить(ВыборкаДетальныеЗаписи.Должник);
			//	 Сообщить(ВыборкаДетальныеЗаписи.Отдел);
			//	 Сообщить(ВыборкаДетальныеЗаписи.БанкиСсылка);
			//

			//	
			//КонецЦикла;
			//

			
	  //.Кол-во должников в архиве на начало
	  
	   Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаОтделСрезПоследних.Должник КАК Должник,
		|	ПривязкаОтделСрезПоследних.Отдел КАК Отдел
		|ПОМЕСТИТЬ НеАрхивОтдел
		|ИЗ
		|	РегистрСведений.ПривязкаОтдел.СрезПоследних(&МоментВремени, ) КАК ПривязкаОтделСрезПоследних
		|ГДЕ
		|	ПривязкаОтделСрезПоследних.Отдел.РольОтдела = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеАрхивОтдел.Должник КАК Должник,
		|	НеАрхивОтдел.Отдел КАК Отдел,
		|	Банки.Ссылка КАК БанкиСсылка
		|ИЗ
		|	НеАрхивОтдел КАК НеАрхивОтдел
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ПО Договоры.Банк = Банки.Ссылка
		|		ПО НеАрхивОтдел.Должник = Договоры.Владелец
		|ГДЕ
		|	Банки.Ссылка В(&БанкСсылка)";
	
	Запрос.УстановитьПараметр("БанкСсылка", БанкЭкс);
	
	Запрос.УстановитьПараметр("МоментВремени", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("Ссылка", Перечисления.РольОтдела.Архив);

	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КолВАрхивеНаНачало=ВыборкаДетальныеЗаписи.Количество();
	
	//Сообщить(КолВАрхивеНаНачало);
	
	
	     //.Кол-во должников в архиве на Конец
	  
	   Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаОтделСрезПоследних.Должник КАК Должник,
		|	ПривязкаОтделСрезПоследних.Отдел КАК Отдел
		|ПОМЕСТИТЬ НеАрхивОтдел
		|ИЗ
		|	РегистрСведений.ПривязкаОтдел.СрезПоследних(&МоментВремени, ) КАК ПривязкаОтделСрезПоследних
		|ГДЕ
		|	ПривязкаОтделСрезПоследних.Отдел.РольОтдела = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеАрхивОтдел.Должник КАК Должник,
		|	НеАрхивОтдел.Отдел КАК Отдел,
		|	Банки.Ссылка КАК БанкиСсылка
		|ИЗ
		|	НеАрхивОтдел КАК НеАрхивОтдел
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ПО Договоры.Банк = Банки.Ссылка
		|		ПО НеАрхивОтдел.Должник = Договоры.Владелец
		|ГДЕ
		|	Банки.Ссылка В(&БанкСсылка)";
	
	Запрос.УстановитьПараметр("БанкСсылка", БанкЭкс);
	
	Запрос.УстановитьПараметр("МоментВремени", Объект.ДатаКонец);
	Запрос.УстановитьПараметр("Ссылка", Перечисления.РольОтдела.Архив);

	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КолВАрхивеНаКонец=ВыборкаДетальныеЗаписи.Количество();
	
	//Сообщить(КолВАрхивеНаКонец);
	
	 ПогасилосьВОтчетномПериоде=КолВАрхивеНаКонец-КолВАрхивеНаНачало;
	 
	 
	 
	 
	 //  А попробую по рееестрам пройду
	 
	          	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачальныеДанныеДоговора.Договор КАК Договор,
		|	НачальныеДанныеДоговора.Договор.Владелец КАК ДоговорВладелец
		|ИЗ
		|	РегистрСведений.НачальныеДанныеДоговора КАК НачальныеДанныеДоговора
		|ГДЕ
		|	НачальныеДанныеДоговора.Период МЕЖДУ &ДатаНачала И &ДатаКонец
		|	И НачальныеДанныеДоговора.Договор.Банк В (&Банк)";
	
	Запрос.УстановитьПараметр("Банк", БанкЭкс);
	Запрос.УстановитьПараметр("ДатаКонец", Объект.ДатаКонец);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		
	КолДолжПолученоЗаПериод= ВыборкаДетальныеЗаписи.Количество();

	 
	 
	 
	 
	
	
//Кол-во должников в работе на Конец периода
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаОтделСрезПоследних.Должник КАК Должник,
		|	ПривязкаОтделСрезПоследних.Отдел КАК Отдел
		|ПОМЕСТИТЬ НеАрхивОтдел
		|ИЗ
		|	РегистрСведений.ПривязкаОтдел.СрезПоследних(&МоментВремени, ) КАК ПривязкаОтделСрезПоследних
		|ГДЕ
		|	ПривязкаОтделСрезПоследних.Отдел.РольОтдела <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеАрхивОтдел.Должник КАК Должник,
		|	НеАрхивОтдел.Отдел КАК Отдел,
		|	Банки.Ссылка КАК БанкиСсылка
		|ИЗ
		|	НеАрхивОтдел КАК НеАрхивОтдел
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ПО Договоры.Банк = Банки.Ссылка
		|		ПО НеАрхивОтдел.Должник = Договоры.Владелец
		|ГДЕ
		|	Банки.Ссылка В(&БанкСсылка)";
	
	Запрос.УстановитьПараметр("БанкСсылка", БанкЭкс);
	
	Запрос.УстановитьПараметр("МоментВремени", Объект.ДатаКонец);
	Запрос.УстановитьПараметр("Ссылка", Перечисления.РольОтдела.Архив);

	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Кол=ВыборкаДетальныеЗаписи.Количество();
	 
	КолДолжниковНаКонецПер=Кол;

	КолДолжниковНаКонец=КолДолжниковНаКонецПер;
	
	//КолДолжПолученоЗаПериод=КолДолжниковНаКонецПер-КолДолжниковНаНаяало- ПогасилосьВОтчетномПериоде;
	
	Сообщить(КолДолжниковНаКонецПер-КолДолжниковНаНаяало- ПогасилосьВОтчетномПериоде);
	
	//Сообщить(КолДолжниковНаКонецПер- КолВАрхивеНаНачало);
	 
	
	
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
	  
      
	 // Совершено платежей в отчетном периоде[Степанов И.А.]  Кол-во платежей за период с ХХХ по ХХХ 
	 
	 

	      СуммаИтог=0;
	 
	 
    	//СУММА(ПлатежиДолжники.Сумма) КАК Сумма

    	
    	  Запрос = Новый Запрос;
         Запрос.Текст = 
    	"ВЫБРАТЬ
    	|	СУММА(ПлатежиДолжники.Сумма) КАК Сумма
    	|ИЗ
    	|	Документ.Платежи.Должники КАК ПлатежиДолжники
    	|ГДЕ
    	|	ПлатежиДолжники.Ссылка.Банк В(&Банк) И ПлатежиДолжники.Ссылка.Проведен = Истина 
    	|	И ПлатежиДолжники.ДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаКонец";
    
    
    
    // 
    //  КоличествоПлатежейЗаПериод=ВыборкаДетальныеЗаписи.Количество();

      Запрос.УстановитьПараметр("Банк", БанкЭкс);
    Запрос.УстановитьПараметр("ДатаКонец", Объект.ДатаКонец);
    Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);

    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
   КоличествоПлатежейЗаПериод=ВыборкаДетальныеЗаписи.Количество();

    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    	// Вставить обработку выборки ВыборкаДетальныеЗаписи
    	
    	  СуммаИтог=ВыборкаДетальныеЗаписи.Сумма;
    	
    	
    КонецЦикла;
    

	
	
	
	СуммаПлатежейЗаПериод=СуммаИтог;

	
	
	
	//   Заполню таблицу
	
	
	
	
	
	 Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПривязкаОтделСрезПоследних.Должник КАК Должник,
		|	СтатусыДолжниковСрезПоследних.Статус КАК Статус
		|ПОМЕСТИТЬ Должники
		|ИЗ
		|	РегистрСведений.ПривязкаОтдел.СрезПоследних(&МоментВремени, ) КАК ПривязкаОтделСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДолжников.СрезПоследних(&МоментВремени, ) КАК СтатусыДолжниковСрезПоследних
		|		ПО ПривязкаОтделСрезПоследних.Должник = СтатусыДолжниковСрезПоследних.Должник
		|ГДЕ
		|	ПривязкаОтделСрезПоследних.Отдел.РольОтдела <> &РольОтдела
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Договоры.СуммаКредита КАК СуммаКредита,
		|	Договоры.Владелец.Ссылка КАК ВладелецСсылка,
		|	Договоры.Ссылка КАК Ссылка,
		|	ДанныеДоговоровСрезПоследних.ВсегоЗадолженность КАК ВсегоЗадолженность
		|ПОМЕСТИТЬ СуммаКредитаД
		|ИЗ
		|	РегистрСведений.ДанныеДоговоров.СрезПоследних(&МоментВремени, ) КАК ДанныеДоговоровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|		ПО ДанныеДоговоровСрезПоследних.Договор = Договоры.Ссылка
		|ГДЕ
		|	Договоры.Банк В(&Банк)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СуммаКредитаД.СуммаКредита КАК СуммаКредита,
		|	Должники.Должник.Регион.СинонимФСПП КАК ДолжникРегионСинонимФСПП,
		|	СуммаКредитаД.Ссылка КАК Ссылка,
		|	Должники.Статус КАК Статус,
		|	СуммаКредитаД.Ссылка КАК СсылкаДоговор,
		|	СуммаКредитаД.Ссылка.НомерДоговора КАК СсылкаНомерДоговора,
		|	Должники.Должник КАК Должник,
		|	СуммаКредитаД.ВсегоЗадолженность КАК ВсегоЗадолженность
		|ИЗ
		|	Должники КАК Должники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммаКредитаД КАК СуммаКредитаД
		|		ПО Должники.Должник = СуммаКредитаД.ВладелецСсылка";

	
		
	Запрос.УстановитьПараметр("Банк", БанкЭкс);
	Запрос.УстановитьПараметр("МоментВремени", Объект.ДатаКонец);
	Запрос.УстановитьПараметр("РольОтдела", Перечисления.РольОтдела.Архив);



	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		      Запись=Объект.ТЧ.Добавить();
		      Запись.Должник=Выборка.Должник;
			  Запись.Договор=Выборка.СсылкаДоговор;
			  Запись.ВсегоЗадолженность=Выборка.ВсегоЗадолженность;
			  Запись.Регион=Выборка.ДолжникРегионСинонимФСПП;
			  Запись.Статус=Выборка.Статус;
			  
			  // Найду все платежи этого должника
			  
												
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ПлатежиОбороты.СуммаОборот КАК СуммаОборот
							|ИЗ
							|	РегистрНакопления.Платежи.Обороты(
							|			,
							|			,
							|			,
							|			Должник = &Должник
							|				И Договор = &Договор) КАК ПлатежиОбороты";
						
						Запрос.УстановитьПараметр("Договор", Выборка.СсылкаДоговор);
						Запрос.УстановитьПараметр("Должник", Выборка.Должник);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
						 Запись.СуммаПлатежей=ВыборкаДетальныеЗаписи.СуммаОборот;	
						КонецЦикла;
						
					
		// найду коментарии за период  Документ Контакт
		
		                        КоментарийСтрока="";
		
		                             	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
										// Данный фрагмент построен конструктором.
										// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
										
										Запрос = Новый Запрос;
										Запрос.Текст = 
											"ВЫБРАТЬ
											|	Контакт.Комментарий КАК Комментарий
											|ИЗ
											|	Документ.Контакт КАК Контакт
											|ГДЕ
											|	Контакт.Дата МЕЖДУ &ДатаНачала И &ДатаКонец
											|	И Контакт.Должник = &Должник";
										
										Запрос.УстановитьПараметр("ДатаКонец", Объект.ДатаКонец);
										Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
										Запрос.УстановитьПараметр("Должник", Выборка.Должник);
										
										РезультатЗапроса = Запрос.Выполнить();
										
										ВыборкаКоментарий = РезультатЗапроса.Выбрать();
										
										Пока ВыборкаКоментарий.Следующий() Цикл
											// Вставить обработку выборки ВыборкаДетальныеЗаписи
											
											 КоментарийСтрока=КоментарийСтрока+ ВыборкаКоментарий.Комментарий+Символы.ВК;
											
										КонецЦикла;
										
										//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
										
										
                           Запись.Коментарии=КоментарийСтрока; 
										 
						   
						   //Найду VIN
						   
						  СсылкаДопРекв=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("VIN");
						  
						  СсылкаДопРеквЗалог=Справочники.ДополнительныеРеквизиты.НайтиПоНаименованию("ЗАЛОГ");
						  
						   
						   допреквин="";
						   допрекзалог="";
						   
						//   
						//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						// Данный фрагмент построен конструктором.
						// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
						//
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ДополнительныеДанные.Наименование КАК Наименование,
							|	ДополнительныеДанные.Реквизит КАК Реквизит
							|ИЗ
							|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
							|ГДЕ
							|	ДополнительныеДанные.Владелец = &Владелец
							|	И ДополнительныеДанные.Реквизит = &Реквизит";
						
						Запрос.УстановитьПараметр("Владелец", Выборка.Должник);
						Запрос.УстановитьПараметр("Реквизит", СсылкаДопРекв);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДопРек = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДопРек.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
							  допреквин=допреквин+" "+ВыборкаДопРек.Наименование;
							
						КонецЦикла;
						
						//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
						
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ДополнительныеДанные.Наименование КАК Наименование,
							|	ДополнительныеДанные.Реквизит КАК Реквизит
							|ИЗ
							|	Справочник.ДополнительныеДанные КАК ДополнительныеДанные
							|ГДЕ
							|	ДополнительныеДанные.Владелец = &Владелец
							|	И ДополнительныеДанные.Реквизит = &Реквизит";
						
						Запрос.УстановитьПараметр("Владелец", Выборка.Должник);
						Запрос.УстановитьПараметр("Реквизит", СсылкаДопРеквЗалог);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДопРек = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДопРек.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
							  допрекзалог=допрекзалог+" "+ВыборкаДопРек.Наименование;
							
						КонецЦикла;

						
						
						

						


					Запись.VINНОМЕР=допреквин;
					
					Запись.Залог=допрекзалог;
			  
			  
			  
			  
			  
		
	КонецЦикла;
	




	


	
	
                   Объект.ТЧ.Сортировать("Должник");
	
	

КонецПроцедуры



&НаСервере
Функция ПолучитьМакетНаСервере()
	
	ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ТолькоПросмотр=Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 

	
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	
    Макет =  ОтчетОбъект.ПолучитьМакет("Макет"); 
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	
	 	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
		
		
		
		ОбластьШапка.Параметры.НачалоПериода=Формат(Объект.ДатаНачала,"ДФ=dd.MM.yyyy");
		
		ОбластьШапка.Параметры.КонецПериода=Формат(Объект.ДатаКонец,"ДФ=dd.MM.yyyy");
		
		
		
		ОбластьШапка.Параметры.КолДолНачало=КолДолжниковНаНаяало;
		
		ОбластьШапка.Параметры.КолДолКонец=КолДолжниковНаКонец;
		
		ОбластьШапка.Параметры.КолДолжЗагр=КолДолжПолученоЗаПериод;
		
		ОбластьШапка.Параметры.КолДолУшло=ПогасилосьВОтчетномПериоде;
		
		ОбластьШапка.Параметры.КолПлатЗаПер=КоличествоПлатежейЗаПериод;
		
		ОбластьШапка.Параметры.СуммаЗаПер=СуммаПлатежейЗаПериод;
		
		
		
		
		
		
		
		
	
    ТабДокумент.Вывести(ОбластьШапка);
	
	
	Для каждого Стр  Из Объект.ТЧ  Цикл
		
		ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
		
		ОбластьСтрока.Параметры.Должник=Стр.Должник;
		
		ОбластьСтрока.Параметры.Договор=Стр.Договор;
		ОбластьСтрока.Параметры.ВсегоЗадолженность=Стр.ВсегоЗадолженность;
		ОбластьСтрока.Параметры.Регион=Стр.Регион;
		ОбластьСтрока.Параметры.Статус=Стр.Статус;
		ОбластьСтрока.Параметры.СуммаПлатежей=Стр.СуммаПлатежей;
		ОбластьСтрока.Параметры.Коментарии=Стр.Коментарии;
		ОбластьСтрока.Параметры.допинф=Стр.VINНОМЕР;
		ОбластьСтрока.Параметры.залог=Стр.Залог;
		ОбластьСтрока.Параметры.Банк=Стр.Банк;
		ОбластьСтрока.Параметры.Отдел=Стр.Отдел;
		
		
		
		
		 ТабДокумент.Вывести(ОбластьСтрока);
	
	КонецЦикла;
	
	
	

	

    Возврат  ТабДокумент;
    
КонецФункции


&НаКлиенте
Процедура Печать(Команда)
	
	
	//КолДолжниковНаНаяало=Элементы.КолДолжниковНаНаяало;
	
	
	ТабДокумент= ПолучитьМакетНаСервере();
	
     ТабДокумент.Показать("Отчет по агентской схеме");

	
КонецПроцедуры
